<p><b>PHP developer test</b></p>
<p>Завдання:</p>
<p>Розробити систему коментарів (по принципу disqus).</p>
<br>
<p><b>Функціонал:</b></p>
<li>1. Перегляд списку коментарів;</li>
<li>2. Написання коментарів;</li>
<li>3. Редагування та видалення власних коментарів;</li>
<li>4. Авторизація.</li>
<br>
<li><b>Рекомендовані можливості:</b></li>
<li>1. Ajax-підвантаження коментарів;</li>
<li>2. Ajax-написання, редагування та видалення коментарів;</li>
<li>3. Можливість виставляти рейтинг коментарям;</li>
<li>4. Можливість оцінювати коментарі тільки інших користувачів;</li>
<li>5. Вкладеність коментарів.</li>
<br>
<li><b>Вимоги:</b></li>
<li>1. Використовувати парадигму програмування ООП;</li>
<li>2. Використовувати архітектурний шаблон MVC;</li>
<li>3. Не використовувати готові PHP рішення (ні бібліотеки, ні
cкріпти/сніппети та інші допоміжні засоби);</li>
<li>4. Завдання має бути доступне на GitHub.</li>

